* McDowell (2020) 15n
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS:
#+begin_example
Name                                  | mcdowell_2021_15n
Alternate name                        | 
Data source                           |  McDowell, I. E., Humphrey, N. F., Harper, J. T., and Meierbachtol, T. W.: The cooling signature of basal crevasses in a hard-bedded region of the Greenland Ice Sheet, The Cryosphere, 15, 897–907, https://doi.org/10.5194/tc-15-897-2021, 2021.
Drill year(s)                         | 2015
Data year(s)                          | August 2016
Longitude [°E]                        | -49.56691397
Latitude [°N]                         | 67.183124
Approximate location name             | 
Location source                       | 
Ice thickness [m]                     | 640
Ice thickness year                    | 2015
Ice thickness source                  | See raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder
Surface velocity [m yr^-1]            | 
Surface velocity year                 | 
Surface velocity source               | 
Measured from: Top, Bottom, Relative  | B
Depth of top measurement [m]          | 15
Depth of bottom measurement [m]       | 635
#+end_example

** Temperature

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)

** Thickness

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)
 
** Location

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)

** Velocity

** Data                                                 :noexport:

#+BEGIN_SRC python :exports none
import numpy as np
import pandas as pd

df_bot = pd.read_csv("meta.bsv", sep="|", index_col=0, header=None, squeeze=True)
thick = np.float(df_bot['Ice thickness [m]'])
df = pd.read_csv('data_bottom.csv')
df = df[df.columns[::-1]]  # swap from d,t to t,d
df['d'] = thick - df['d']
df.to_csv('data.csv', index=False)
#+END_SRC

#+RESULTS:
: None

#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k2
#+END_SRC

#+RESULTS:
|                   t |     d |
|       -9.5724853047 |  15.0 |
|      -10.3982990443 |  35.0 |
| -10.599112783899999 |  55.0 |
| -11.125740263099999 |  95.0 |
|      -11.5140540027 | 115.0 |
| -11.527367742300001 | 135.0 |
|      -11.7281814819 | 155.0 |
| -11.741495221500001 | 175.0 |
| -11.817308961099998 | 195.0 |
|      -11.7681227007 | 215.0 |
|      -11.7189364403 | 235.0 |
|      -11.7322501799 | 255.0 |
|      -11.6830639195 | 275.0 |
| -11.571377659100001 | 295.0 |
| -11.459691398699999 | 315.0 |
|      -11.2230051383 | 335.0 |
|      -10.6246326175 | 375.0 |
|      -10.2004463571 | 395.0 |
|       -9.7762600967 | 415.0 |
|       -9.1645738363 | 435.0 |
|       -8.5528875759 | 455.0 |
|       -7.8787013155 | 475.0 |
|       -7.1420150551 | 495.0 |
|       -6.7736719249 | 505.0 |
|       -6.3428287947 | 515.0 |
|       -5.9744856645 | 525.0 |
|  -5.418642534299999 | 535.0 |
| -5.0502994041000004 | 545.0 |
|       -4.5569562739 | 555.0 |
| -4.0636131437000005 | 565.0 |
|       -3.5077700135 | 575.0 |
| -3.0769268832999996 | 585.0 |
|       -2.5210837531 | 595.0 |
|       -2.0277406229 | 605.0 |
| -1.5968974927000001 | 615.0 |
|       -1.1035543625 | 625.0 |
| -0.7352112323000001 | 635.0 |

